---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeStructuralDepthOnRun
source: html/2f54f1a2-3403-dcca-bebf-0f7ab490a4fe.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsSupporttypeStructuralDepthOnRun Property

"Structural Depth On Run": Structural Depth

## Syntax (C#)
```csharp
public static ForgeTypeId StairsSupporttypeStructuralDepthOnRun { get; }
```